lvx/base/DataProcessors/бит_ГрупповоеРедактированиеДополнительныхАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ГрупповоеРедактированиеДополнительныхАналитик</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаботаСДопАналитиками</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>210</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапретитьПерезаполнениеАналитик</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РедактироватьФактическиеДанные</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модифицированность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьРеквизитПлатежнаяПозиция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьРеквизитПланируемоеПоступление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбрать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проведен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аналитики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеАналитики</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяАналитики</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АналитикиТолькоЧтение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеАналитики</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеАналитикиСтарое</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяАналитики</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/InformationRegisters/бит_СоответствиеЗаписейТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СоответствиеЗаписейТрансляции</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СлужебнаяОтметкаДт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравилаТрансляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяОтметкаКт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравилаТрансляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Comment>Источник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приемник</Name>
					<Comment>Приемник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиИсточника</Name>
					<Comment>Номер строки источника</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиПриемника</Name>
					<Comment>Номер строки приемника</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/DataProcessors/бит_ГрупповоеРедактированиеДополнительныхАналитик/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция СписокВыбранныхДокументов(ДанныеФормы, ДанныеОбъекта) Экспорт

	РезультатКомпоновки = РезультатКомпоновкиДанныхВыбранныеДокументы(ДанныеФормы, ДанныеОбъекта);
    СоответствиеЕстьРеквизит = Новый Соответствие;
			
	СписокДокументов = Новый ТаблицаЗначений;
	КоллекцияКолонок = Метаданные.Обработки.бит_ГрупповоеРедактированиеДополнительныхАналитик.ТабличныеЧасти.Документы.Реквизиты;
	Для каждого Колонка Из КоллекцияКолонок Цикл
		СписокДокументов.Колонки.Добавить(Колонка.Имя, Колонка.Тип);
	КонецЦикла;
	
	// Синхронизируем имена колонко списков, что бы заполнять одним махом.
	Для каждого Колонка Из РезультатКомпоновки.Колонки Цикл
		Поле = Колонка.Имя;
		Если СтрНачинаетсяС(Поле, "Документ") И СтрДлина(Поле) > 8 Тогда
			Поле = Сред(Поле, 9);
		КонецЕсли; 
		Если КоллекцияКолонок.Найти(Поле) <> Неопределено Тогда
			Колонка.Имя = Поле;
		КонецЕсли; 
	КонецЦикла; 
		
	Для Каждого Выборка Из РезультатКомпоновки Цикл 
	 
		НоваяСтрока = СписокДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	    
	    МетаданныеДок      = Выборка.Документ.Метаданные();
	    РеквизитыДокумента = МетаданныеДок.Реквизиты;
		
	    // ЕстьРеквизитПлатежнаяПозиция, ЕстьРеквизитПланируемоеПоступление
	    НастройкиМетаданных = СоответствиеЕстьРеквизит.Получить(МетаданныеДок.Имя); 
	    Если НастройкиМетаданных = Неопределено Тогда        
	        ЕстьРеквизитПлатежнаяПозиция       = Ложь;
	        ЕстьРеквизитПланируемоеПоступление = Ложь;        
	        НастройкиМетаданных = Новый Структура("ЕстьРеквизитПлатежнаяПозиция, ЕстьРеквизитПланируемоеПоступление",
	                                            		ЕстьРеквизитПлатежнаяПозиция, ЕстьРеквизитПланируемоеПоступление);
	        СоответствиеЕстьРеквизит.Вставить(МетаданныеДок.Имя, НастройкиМетаданных);                    
	    КонецЕсли;            
	    НоваяСтрока.ЕстьРеквизитПлатежнаяПозиция       = НастройкиМетаданных.ЕстьРеквизитПлатежнаяПозиция;
	    НоваяСтрока.ЕстьРеквизитПланируемоеПоступление = НастройкиМетаданных.ЕстьРеквизитПланируемоеПоступление;
	        
	КонецЦикла;  

	Возврат СписокДокументов;
	
КонецФункции

Функция ЭтотДокументРаботаетСАналитиками(ТекущийДокумент) Экспорт
	
	ТипыДокументовСАналитиками = Метаданные.РегистрыСведений.бит_ДополнительныеАналитики.Измерения.Объект.Тип;
	Возврат ТипыДокументовСАналитиками.СодержитТип(ТипЗнч(ТекущийДокумент));
				
КонецФункции

#Область ЗаписьИзменений

Функция ЗаписатьИзмененияОбъектов(ДанныеФормы, ДанныеОбъекта, ПараметрыЗаписи, АналитикиМодифицированы) Экспорт
	
	ПротоколРасчетаМПЗ = "";
	АналитикиЗаписаны = Истина;
	НачалоТрансляции = ТекущаяДатаСеанса();
	
	ОбъектыДляЗаписи = ДанныеОбъекта.ОбъектыДляЗаписи;
	
	ИсточникиТрансляции = ДанныеФормы.ИсточникиТрансляции;
	ПриемникиТрансляции = ДанныеФормы.ПриемникиТрансляции;
	ИспользоватьРучнуюКорректировкуФакта = ДанныеФормы.ИспользоватьРучнуюКорректировкуФакта;
	ПереключательЗПА	= ДанныеФормы.ПереключательЗПА;
	ТекущийОбъектСсылка = ДанныеФормы.ТекущийОбъектСсылка;
	РежимСообщений		= ДанныеФормы.РежимСообщений;
	
	// Журнал регистрации и первоначальные проверки.
	Если ПараметрыЗаписи.ВыполнитьТрансляцию Или ПараметрыЗаписи.ВыполнитьПроведениеБит Тогда		
		ТекстСообщения = НСтр("ru='Начало выполнения групповой трансляции';en='Beginning of group events'");
		ВывестиИнформациюВЖурналРегистрации(ТекстСообщения); 		
	ИначеЕсли ПараметрыЗаписи.ОтменитьТрансляцию Тогда 		
		Если НЕ ЗначениеЗаполнено(ПриемникиТрансляции) Тогда
			ТекстСообщения = НСтр("ru='Не указаны приемники для отмены трансляции движений.';
								  |en='Do not tell the receiver to cancel the translation movements.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
			ПараметрыЗаписи.Вставить("ОтменитьТрансляцию", Ложь);
		Иначе
			ТекстСообщения = НСтр("ru='Начало выполнения групповой отмены трансляции';
							  |en='Beginning of group cancellation broadcast'");
			ВывестиИнформациюВЖурналРегистрации(ТекстСообщения);
		КонецЕсли;		
	ИначеЕсли ПараметрыЗаписи.РассчитатьПартииМПЗ Тогда
		ТекстСообщения = НСтр("ru='Начало выполнения групповой трансляции (Расчет партий МПЗ)';
							  |en='Beginning of group coverage (Calculation parties MSY)'");
		ВывестиИнформациюВЖурналРегистрации(ТекстСообщения);
		ПротоколРасчетаМПЗ = "";
    КонецЕсли; 
	
	// Удалим закрытые от редактирования.
	ВыделитьЗакрытыеДляРедактирования(ОбъектыДляЗаписи);
	
	ВсеСсылки					= ОбъектыДляЗаписи.ВыгрузитьКолонку("Документ");
    ВключенРежимЗаполнятьВсегда = бит_МеханизмДопИзмерений.ВключенРежимЗаполнятьВсегда();  
	ДокументыСРФД	 			= ДокументыСРФД(ВсеСсылки, ИспользоватьРучнуюКорректировкуФакта);
	
	РегистрыИсточники = Неопределено;
	РегистрыПриемники = Неопределено;
	
	Если ЗначениеЗаполнено(ИсточникиТрансляции) Тогда
		РегистрыИсточники = ИсточникиТрансляции.ВыгрузитьЗначения();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПриемникиТрансляции) Тогда
		РегистрыПриемники = ПриемникиТрансляции.ВыгрузитьЗначения();
	КонецЕсли;

	ВыполнитьПроведениеБит = ПараметрыЗаписи.ВыполнитьПроведениеБит;
	
	Для каждого СтрокаТаблицы Из ОбъектыДляЗаписи Цикл
		ОбъектСсылка  = СтрокаТаблицы.Документ;
		
		НачатьТранзакцию();
		Попытка		
			// Запись признака "ЗапретитьПерезаполнениеАналитик" в регистр сведений бит_ДополнительныеПараметрыОбъектов.
			Если ВключенРежимЗаполнятьВсегда Тогда
				// Текущий документ в списке документов.
				Если ПереключательЗПА <> 0 Тогда
					ЗПАДокументаЧислом = ?(СтрокаТаблицы.ЗапретитьПерезаполнениеАналитик, 1, 2); 
					Если ЗПАДокументаЧислом <> ПереключательЗПА Тогда
						ЗапретитьПерезаполнениеАналитик 				= (ПереключательЗПА = 1);                                         
						СтрокаТаблицы.ЗапретитьПерезаполнениеАналитик = ЗапретитьПерезаполнениеАналитик;
						
						ДанныеДляУстановки = Новый Структура("ЗапретитьПерезаполнениеАналитик", ЗапретитьПерезаполнениеАналитик);					
						бит_МеханизмДопИзмерений.ЗаписатьДополнительныеПараметрыОбъекта(ОбъектСсылка, ДанныеДляУстановки);
					КонецЕсли;          
				КонецЕсли;	
			КонецЕсли;
			
			ЗаписатьРучнуюКорректировкуФактаБП(СтрокаТаблицы, ДокументыСРФД, ДанныеФормы);
			
			// При всех режимах записываем аналитики, если они изменены
			Если АналитикиМодифицированы Тогда
				ДополнительныеАналитики = ДополнительныеАналитики(ОбъектСсылка, ПараметрыЗаписи.ИсточникДопАналитик, ДанныеФормы, ДанныеОбъекта);
				ЗаписатьАналитикиНаСервере(ОбъектСсылка, ДополнительныеАналитики, РежимСообщений);
			КонецЕсли;
			
			// Запись аналитик у проведеного документа порождает формирование движений по регистрам БИТ.ФИНАНС.
			Если ПараметрыЗаписи.ВыполнитьЗаписьАналитик Тогда
				ПараметрыЗаписи.ВыполнитьПроведениеБит = СтрокаТаблицы.Проведен;			
			КонецЕсли;
			
			Если ПараметрыЗаписи.ВыполнитьПроведение Тогда 
				
				// Проведение документа
				ПровестиДокументСервер(ОбъектСсылка, ДанныеФормы);
				
			ИначеЕсли ПараметрыЗаписи.ОтменитьТрансляцию Тогда
				
				// Отмена трансляции
				ОтменитьТрансляциюПроводокСервер(ОбъектСсылка, РегистрыПриемники, ДанныеФормы);
				
			ИначеЕсли ПараметрыЗаписи.ВыполнитьТрансляцию Или ПараметрыЗаписи.ВыполнитьПроведениеБит Тогда 
				
				Если ОбъектСсылка.ПометкаУдаления Тогда 
					ТекстСообщения = НСтр("ru = 'Документ %1 помечен на удаление, трансляция невозможна.'; 
						|en = 'Document %1 is marked for deletion and cannot be translated.'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектСсылка);
					ВызватьИсключение ТекстСообщения;
					
				ИначеЕсли ОбъектСсылка.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить И Не ОбъектСсылка.Проведен Тогда
					ТекстСообщения = НСтр("ru='Для выполнения процедуры необходимо провести документ %1.';
						|en='The procedures necessary to document %1.'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектСсылка);
					ВызватьИсключение ТекстСообщения;
					
				Иначе
					ДокументОбъект = ОбъектСсылка.ПолучитьОбъект();
					Если ПараметрыЗаписи.ВыполнитьТрансляцию Тогда
						// Трансляция
						ВыполнитьТрансляциюПроводокСервер(ДокументОбъект, РегистрыИсточники, РегистрыПриемники, ДанныеФормы);
					ИначеЕсли ПараметрыЗаписи.ВыполнитьПроведениеБит Тогда
						// Проведение по регистрам Бит
						ВыполнитьПроведениеБитСервер(ДокументОбъект);
						ВыполнитьТрансляциюПроводокСервер(ДокументОбъект, РегистрыИсточники, РегистрыПриемники, ДанныеФормы);
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли ПараметрыЗаписи.РассчитатьПартииМПЗ Тогда
				
				РассчитатьПартииМПЗСервер(ОбъектСсылка, ПротоколРасчетаМПЗ);
				ВывестиИнформациюПоТрансляции(ПротоколРасчетаМПЗ, ДанныеФормы);
				
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Если РежимСообщений <> "Нет" Тогда
				ТекстСообщения = НСтр("ru = 'Ошибка обработки документа %1. По причине: %2'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектСсылка, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ОбъектСсылка);
			КонецЕсли;
		КонецПопытки;
	КонецЦикла;
	
	// Журнал регистрации.
	Если ПараметрыЗаписи.ВыполнитьТрансляцию Или ПараметрыЗаписи.ВыполнитьПроведениеБит Тогда			
		ВывестиИнформациюВЖурналРегистрации(НСтр("ru='Окончание выполнения групповой трансляции';
												 |en='End of the action group broadcast'"));
	ИначеЕсли ПараметрыЗаписи.ОтменитьТрансляцию Тогда	
		ВывестиИнформациюВЖурналРегистрации(НСтр("ru='Окончание выполнения групповой отмены трансляции';
												 |en='End of the action group cancel broadcast'"));
	ИначеЕсли ПараметрыЗаписи.РассчитатьПартииМПЗ Тогда	
		ВывестиИнформациюВЖурналРегистрации(НСтр("ru='Окончание выполнения групповой трансляции (Расчет партий МПЗ)';
												 |en='End of the action group broadcast (Calculation parties MSY)'"));
	КонецЕсли;
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("АналитикиЗаписаны", АналитикиЗаписаны);
	РезультатВыполнения.Вставить("ПротоколТрансляции", ДанныеФормы.ПротоколТрансляции);
	РезультатВыполнения.Вставить("Сообщения", ПолучитьСообщенияПользователю(Истина));
	
	Возврат РезультатВыполнения;

КонецФункции

Функция НоваяТаблицаДополнительныеАналитики() Экспорт
	
	НоваяТаблица = Новый ТаблицаЗначений;
	НоваяТаблица.Колонки.Добавить("Аналитика", 		   Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.бит_ВидыДополнительныхАналитик"));
	НоваяТаблица.Колонки.Добавить("ЗначениеАналитики", Метаданные.ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Тип);
	НоваяТаблица.Колонки.Добавить("ИмяАналитики", 	   ОбщегоНазначения.ОписаниеТипаСтрока(150));
	НоваяТаблица.Колонки.Добавить("Изменено", 		   Новый ОписаниеТипов("Булево"));
	НоваяТаблица.Колонки.Добавить("Объект", 		   Неопределено);

	Возврат НоваяТаблица;
	
КонецФункции

#КонецОбласти // ЗаписьИзменений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаписьИзменений

Процедура ВывестиИнформациюВЖурналРегистрации(ТекстРегистрации)

	МетаданныеОбъекта = Метаданные.Обработки.бит_ГрупповоеРедактированиеДополнительныхАналитик;
	
	ЗаписьЖурналаРегистрации(ТекстРегистрации, УровеньЖурналаРегистрации.Информация, 
		Метаданные, , ТекстРегистрации);	

КонецПроцедуры

Процедура ВыделитьЗакрытыеДляРедактирования(ОбъектыДляЗаписи)

    Индекс = ОбъектыДляЗаписи.Количество() - 1;
	Пока Индекс >= 0 Цикл
		СтрокаТаблицы = ОбъектыДляЗаписи.Получить(Индекс); 
		ОбъектСсылка = СтрокаТаблицы.Документ;
		МетаОбъект	 = ОбъектСсылка.Метаданные();
		ЗапрещеноРедактирование = бит_ДатыЗапретаРедактирования.ВыполнитьПроверкуДатыЗапретаРедактирования(МетаОбъект, ОбъектСсылка);
		Если ЗапрещеноРедактирование Тогда
			ОбъектыДляЗаписи.Удалить(СтрокаТаблицы);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
    
КонецПроцедуры

Функция ДокументыСРФД(Объекты, ИспользоватьРучнуюКорректировкуФакта)
	
	// Для совместимости с БП, КОРП.
	ДокументыСРФД = Новый Массив;
	Если НЕ ИспользоватьРучнуюКорректировкуФакта Тогда
		Возврат ДокументыСРФД;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Объекты);
	Запрос.УстановитьПараметр("ВидОбъекта" , Перечисления.бит_ВидыОбъектовСистемы.РегистрНакопления);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыСистемы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ОбСист
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК ОбъектыСистемы
	|ГДЕ
	|	ОбъектыСистемы.ВидОбъекта = &ВидОбъекта
	|	И ОбъектыСистемы.ИмяОбъекта = ""бит_ОборотыПоБюджетам""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоответствиеЗаписейТрансляции.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.бит_СоответствиеЗаписейТрансляции КАК СоответствиеЗаписейТрансляции
	|ГДЕ
	|	СоответствиеЗаписейТрансляции.Регистратор В(&Регистратор)
	|	И СоответствиеЗаписейТрансляции.Приемник В
	|			(ВЫБРАТЬ
	|				ОбСист.Ссылка
	|			ИЗ
	|				ОбСист КАК ОбСист)
	|
	|СГРУППИРОВАТЬ ПО
	|	СоответствиеЗаписейТрансляции.Регистратор";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка			 = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументыСРФД.Добавить(Выборка.Регистратор);
	КонецЦикла;

	Возврат ДокументыСРФД;

КонецФункции

Процедура ЗаписатьРучнуюКорректировкуФактаБП(СвойстваДокумента, ДокументыСРФД, ДанныеФормы)
	
	// Для совместимости с БП, КОРП.
	Совместимо = Истина;
	
КонецПроцедуры

Процедура ЗаписатьАналитикиНаСервере(ОбъектСсылка, ДополнительныеАналитики, РежимСообщений)
	
	Если НЕ ЗначениеЗаполнено(ДополнительныеАналитики) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтотДокументРаботаетСАналитиками(ОбъектСсылка) Тогда
		Возврат;	
	КонецЕсли;
	
	НаборЗаписей = ПолучитьНаборЗаписейДополнительныеАналитики(ОбъектСсылка);
	НаборЗаписей.Загрузить(ДополнительныеАналитики);
	
	НаборЗаписан = бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборЗаписей, РежимСообщений);	
	
КонецПроцедуры

Процедура ПровестиДокументСервер(ОбъектСсылка, ДанныеФормы)

	ДокументОбъект = ОбъектСсылка.ПолучитьОбъект();	
	
	Попытка
		ДокументОбъект.Заблокировать();
		МожноЗаписатьДокумент = Истина;
	Исключение
		Если ДанныеФормы.РежимСообщений <> "Нет" Тогда
			ТекстСообщения = НСтр("ru='Документ %1 заблокирован. Проведение невозможно.';
								  |en='Document %1 blocked. Carrying impossible.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектСсылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		КонецЕсли;	
		МожноЗаписатьДокумент = Ложь;
	КонецПопытки;                 
	
	Если МожноЗаписатьДокумент Тогда
			
		ПровестиУдалось = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокументОбъект, РежимЗаписиДокумента.Проведение,, ДанныеФормы.РежимСообщений);
		
		ДокументОбъект.Разблокировать();
	КонецЕсли;  
	
КонецПроцедуры

Процедура ОтменитьТрансляциюПроводокСервер(ОбъектСсылка, РегистрыПриемники, ДанныеФормы)
	
	ДокументОбъект = ОбъектСсылка.ПолучитьОбъект();
	Отказ 		   = Ложь;
	
	Если бит_ОбщегоНазначения.ЕстьМеханизмКонтроляЗакрытогоПериода() Тогда			
		// При наличии механизма контроля закрытого периода сохраним движения для последующего анализа.
		бит_КонтрольЗакрытогоПериода.КонсервироватьДвижения(ДокументОбъект, Отказ, РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);	
	КонецЕсли;
	
	// Выполним отмену трансляции движений.
	Протокол = бит_МеханизмТрансляции.ОтменитьТрансляцию(ОбъектСсылка, РегистрыПриемники);
														   
	Если бит_ОбщегоНазначения.ЕстьМеханизмКонтроляЗакрытогоПериода() Тогда			
		// При наличии механизма контроля закрытого периода сформируем корректирующие проводки.
		бит_КонтрольЗакрытогоПериода.КонтрольПриУдаленииПроведения(ДокументОбъект, Отказ);	
	КонецЕсли;	
	
	Если ДокументОбъект.Заблокирован() Тогда	
		 ДокументОбъект.Разблокировать(); 	
	КонецЕсли;													   
														   
	ВывестиИнформациюПоТрансляции(Протокол, ДанныеФормы); 
		
КонецПроцедуры

Процедура ВывестиИнформациюПоТрансляции(Протокол, ДанныеФормы)

	ВестиПротоколТрансляции = ДанныеФормы.ВестиПротоколТрансляции;
	ПротоколТрансляции 		= ДанныеФормы.ПротоколТрансляции;
	РежимСообщений 			= ДанныеФормы.РежимСообщений;
	
	Если ЗначениеЗаполнено(Протокол) Тогда
		Если ВестиПротоколТрансляции Тогда
			ПротоколТрансляции.ДобавитьСтроку(РазделительПротоколаТрансляции());
			ПротоколТрансляции.ДобавитьСтроку(Протокол);
		КонецЕсли;
		Если РежимСообщений = "Все" Тогда
			ОбщегоНазначения.СообщитьПользователю(Протокол);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьТрансляциюПроводокСервер(ДокументОбъект, РегистрыИсточники, РегистрыПриемники, ДанныеФормы)
	
	Отказ = Ложь;
	ИспользуетсяМеханизмКонтроляЗакрытогоПериода = бит_ОбщегоНазначения.ЕстьМеханизмКонтроляЗакрытогоПериода();
	Если ИспользуетсяМеханизмКонтроляЗакрытогоПериода Тогда			
		// При наличии механизма контроля закрытого периода сохраним движения для последующего анализа.
		бит_КонтрольЗакрытогоПериода.КонсервироватьДвижения(ДокументОбъект, Отказ, РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);	
	КонецЕсли;
	
	бит_МеханизмТрансляции.СохранитьЗначенияИсключенийТрансляции(ДокументОбъект,
							?(ДокументОбъект.ПометкаУдаления, Ложь, Истина), Ложь);
	
	// МХО.
	бит_МеханизмХозяйственныхОперацийСервер.бит_мхо_НастраиваемыеДвиженияДокументовОбработкаПроведения(
		ДокументОбъект, Отказ, РежимПроведенияДокумента.Неоперативный, РегистрыИсточники);
	Для каждого НаборЗаписей Из ДокументОбъект.Движения Цикл
		Если НаборЗаписей.Записывать Тогда
			ДокументОбъект.Движения.Записать();
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	// Трансляция.
	РезДанные = бит_МеханизмТрансляции.ВыполнитьТрансляцию(ДокументОбъект, РегистрыИсточники, 
					РегистрыПриемники, Истина, Перечисления.бит_РежимыТрансляции.Ручной);
	Протокол  = РезДанные.Протокол;
	бит_МеханизмТрансляции.ВосстановитьЗначенияИсключенийТрансляции(ДокументОбъект, Истина);
	
	ДокументыОперации = Новый Массив;
	ДокументыОперации.Добавить(Метаданные.Документы.бит_ОперацияУправленческий);
	
	Если ИспользуетсяМеханизмКонтроляЗакрытогоПериода Тогда
		Если ДокументыОперации.Найти(ДокументОбъект.Метаданные()) <> Неопределено Тогда
			бит_КонтрольЗакрытогоПериода.КонтрольПриЗаписиОперации(ДокументОбъект, Отказ, Истина);
		Иначе	
			бит_КонтрольЗакрытогоПериода.КонтрольПриОбработкеПроведения(ДокументОбъект, Отказ, РежимЗаписиДокумента.Проведение, Истина);	
		КонецЕсли;
	КонецЕсли;	
	
	Если ДокументОбъект.Заблокирован() Тогда	
		 ДокументОбъект.Разблокировать(); 	
	КонецЕсли;														   
															   
  	ВывестиИнформациюПоТрансляции(Протокол, ДанныеФормы); 
		
КонецПроцедуры

Процедура ВыполнитьПроведениеБитСервер(ДокументОбъект)
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ДвиженияДокумента 	= МетаданныеДокумента.Движения;
	
	Отказ 		    = Ложь;
	РежимПроведения = РежимЗаписиДокумента.Запись; 
	
	// ++ЕРП
	// Метаданные регистров	
	ПланируемыйРасходДС		 = Метаданные.РегистрыНакопления.бит_кзн_ПланируемыйРасходДенежныхСредств;
	ПланируемоеПоступлениеДС = Метаданные.РегистрыНакопления.бит_кзн_ПланируемоеПоступлениеДенежныхСредств;
	ОборотыПоБюджетам   	 = Метаданные.РегистрыНакопления.бит_ОборотыПоБюджетам;
	ПроводкиБюджетирования	 = Метаданные.РегистрыБухгалтерии.бит_Бюджетирование;
	
	ВозможныОборотыПоБюджетам   	 = ДвиженияДокумента.Содержит(ОборотыПоБюджетам);	
	ВозможныПроводкиБюджетирования 	 = ДвиженияДокумента.Содержит(ПроводкиБюджетирования);
	
	// Проведения по регистру накопления бит_ОборотыПоБюджетам.
	Если ВозможныОборотыПоБюджетам И ВозможныПроводкиБюджетирования Тогда
		// Необходимо для подготовки (очистки) набора записей.
		// Когда проводки формируются по шаблону из статьи и "Обороты по бюджету" пустой,
		// набор проводок ни как не обрабатывается и остается с данными.
		ДокументОбъект.Движения.бит_Бюджетирование.Записывать = Истина;	
	КонецЕсли;
	
	// Определим доступность движений по регистрам.
	ДоступенРегистрРасходаДС     = ДвиженияДокумента.Содержит(ПланируемыйРасходДС); 
	ДоступенРегистрПоступленияДС = ДвиженияДокумента.Содержит(ПланируемоеПоступлениеДС); 

	// Проведения по регистрам казначейства 								
	Если ДоступенРегистрРасходаДС ИЛИ ДоступенРегистрПоступленияДС Тогда
		бит_Казначейство.ОбработкаПроведенияПлатежногоДокумента(ДокументОбъект, Отказ, РежимПроведения, Истина);
 	КонецЕсли;
	// --ЕРП
	
КонецПроцедуры

Процедура РассчитатьПартииМПЗСервер(ОбъектСсылка, Протокол)
	
	ДокументОбъект = ОбъектСсылка.ПолучитьОбъект();
	Отказ 		   = Ложь;
	
	Если Не бит_ОбщегоНазначения.ЗаблокироватьОбъект(ДокументОбъект, "Все") Тогда
		Возврат;	
	КонецЕсли;
	
	Если ДокументОбъект.Движения.Найти("бит_му_ПартииМПЗ") <> Неопределено Тогда
		
		ДокументОбъект.Движения.бит_му_ПартииМПЗ.Прочитать();
		
		Если ДокументОбъект.Движения.Найти("бит_му_ПартииМПЗСобственныхКонтрагентов") <> Неопределено Тогда
			
			ДокументОбъект.Движения.бит_му_ПартииМПЗСобственныхКонтрагентов.Прочитать();
			
			// Выполняем очистку. 				
			Движения = ДокументОбъект.Движения.бит_му_ПартииМПЗСобственныхКонтрагентов.Выгрузить();

			// 1. Удаляем только записи с видом движения "Приход" - это сторнирующие записи трансляции.
			Отбор       = Новый Структура("ВидДвижения", ВидДвиженияНакопления.Приход);
			МассивСтрок = Движения.НайтиСтроки(Отбор);
			Для каждого Запись Из МассивСтрок Цикл
				Движения.Удалить(Запись);
			КонецЦикла;

			// 2. Удаляем только записи, в которых определен счет учета - это записи списания себестоимости.
			Индекс = Движения.Количество() - 1;
			Пока Индекс >= 0 Цикл
			
				Запись = Движения.Получить(Индекс);
				Если ЗначениеЗаполнено(Запись.СчетУчета) Тогда
					Движения.Удалить(Запись);
				КонецЕсли; 
				Индекс = Индекс - 1;
			КонецЦикла; 
			
			ДокументОбъект.Движения.бит_му_ПартииМПЗСобственныхКонтрагентов.Загрузить(Движения);
			ДокументОбъект.Движения.бит_му_ПартииМПЗСобственныхКонтрагентов.Записать();
			
		КонецЕсли;
		
		МодульМПЗ = ОбщегоНазначения.ОбщийМодуль("бит_му_МПЗ");
		МодульМПЗ.бит_му_ОбработкаПроведенияПартииСобственныхКонтрагентовОбработкаПроведения(ДокументОбъект, 
			Отказ, РежимПроведенияДокумента.Неоперативный);
		
		ДокументОбъект.Движения.бит_му_ПартииМПЗ.Записать();
		
		Если ДокументОбъект.Движения.Найти("бит_му_ПартииМПЗСобственныхКонтрагентов") <> Неопределено Тогда
			ДокументОбъект.Движения.бит_му_ПартииМПЗСобственныхКонтрагентов.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДокументОбъект.Заблокирован() Тогда		
		 ДокументОбъект.Разблокировать();		
	КонецЕсли; 		
	
	Протокол = Протокол + НСтр("ru='Расчет партий МПЗ для документа %1 завершен';
							   |en='Calculation parties inventories to document %1 completed'");	
	Протокол = СтрШаблон(Протокол, ОбъектСсылка);
				
КонецПроцедуры // РассчитатьПартииМПЗСервер()

Функция ПолучитьНаборЗаписейДополнительныеАналитики(ОбъектСсылка)
	
	НаборЗаписей = РегистрыСведений.бит_ДополнительныеАналитики.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ОбъектСсылка);
	НаборЗаписей.Прочитать();
	
    Возврат НаборЗаписей;
	
КонецФункции

Функция ДополнительныеАналитики(Ссылка, ИсточникДопАналитик, ДанныеФормы, ДанныеОбъекта)

	//1. Кнопка "Провести по регистрам БИТ" перезаписывает в регистры БИТ аналитики из ТЧ обработки только, 
	//		если в ней что-то менялось (выделено жирным), при этом:
	//	1.1. "Не перезаписывать существующие": 
	//			заполненные ранее аналитики не меняются в документах.
	//	1.2. "Перезаписывать только установленные": 
	//			меняются и добавляются только аналитики, указанные в ТЧ обработки, остальные не меняются.
	//	1.3. "Перезаписывать весь набор": 
	//			все аналитики документов заменяются на те, которые указаны в ТЧ обработки.
	//
	//2. Кнопка "Заполнить из настроек" - заполняет виды аналитик из регистра "Назначение доп.аналитик документам" 
	//		и устанавливает значения по умолчанию, табличная часть обработки игнорируется, при этом:
	//	2.1. "Не перезаписывать существующие": 
	//			Добавляет и заполняет аналитики, которых не хватает в документе по данным регистра "Назначение доп.аналитик документам",
	//			не трогая уже заполненные аналитики.
	//	2.2. "Перезаписывать только установленные": 
	//			Добавляет и заполняет аналитики, которых не хватает в документе по данным регистра "Назначение доп.аналитик документам", 
	//			обновляя существующие аналитики.
	//	2.3. "Перезаписывать весь набор": 
	//			Перезаполняет все аналитики в документе по данным регистра "Назначение доп.аналитик документам" 
	//			и записывает значения по умолчанию.
	//
	//3.  Кнопка "Обновить из настроек" - не перезаполняет виды аналитик, а только обновляет значения аналитик значениями по умолчанию, 
	//		табличная часть обработки игнорируется, при этом:
	//	3.1. "Не перезаписывать существующие": 
	//			Заполненные ранее аналитики не меняются в документах. 
	//	3.2. "Перезаписывать только установленные": 
	//			Обновляет значения аналитик по настройкам, не добавляя новых аналитик.
	//	3.3. "Перезаписывать весь набор": 
	//			Обновляет значения аналитик по настройкам, не добавляя новых аналитик.
	
	РежимЗаписиАналитик 	= ДанныеФормы.РежимЗаписиАналитик;
	НоваяТаблица			= НоваяТаблицаДополнительныеАналитики();
	ДополнительныеАналитики = НоваяТаблицаДополнительныеАналитики();
	
	Если НЕ ЭтотДокументРаботаетСАналитиками(Ссылка) Тогда
		Возврат НоваяТаблица;	
	КонецЕсли;
	
	Если ИсточникДопАналитик = 0  Тогда
		Для каждого СтрокаТаблицы Из ДанныеОбъекта.Аналитики Цикл
			Если СтрокаТаблицы.Изменено Тогда
				ЗаполнитьЗначенияСвойств(ДополнительныеАналитики.Добавить(), СтрокаТаблицы);			
			КонецЕсли;
		КонецЦикла;
	Иначе	
		бит_МеханизмДопИзмерений.ЗаполнитьДополнительныеАналитикиПоУмолчанию(Ссылка, ДополнительныеАналитики,
			Истина, Ложь);
		ДополнительныеАналитики.ЗаполнитьЗначения(Истина, "Изменено");	
	КонецЕсли;	

	ДанныеБазы 	 = ПолучитьНаборЗаписейДополнительныеАналитики(Ссылка).Выгрузить();
	НадоЗаписать = Ложь;	
	Если РежимЗаписиАналитик = "Перезаписывать" Тогда
		Если ИсточникДопАналитик = 0 ИЛИ ИсточникДопАналитик = 1 Тогда
			// 1.3 и 2.3:Скопировать "помеченные" из формы или заполнить для нового документа.
			НоваяТаблица = ДополнительныеАналитики.Скопировать();
			НадоЗаписать = ЗначениеЗаполнено(НоваяТаблица);
		Иначе	
			// 3.3: Обновить значения, не меняя состав.
			НоваяТаблица = ДанныеБазы.Скопировать();
			Для каждого СтрокаТаблицы Из НоваяТаблица Цикл
				РезультатПоиска = ДополнительныеАналитики.Найти(СтрокаТаблицы.Аналитика, "Аналитика");
				Если ЗначениеЗаполнено(РезультатПоиска) Тогда
					Если СтрокаТаблицы.ЗначениеАналитики <> РезультатПоиска.ЗначениеАналитики Тогда
						СтрокаТаблицы.ЗначениеАналитики = РезультатПоиска.ЗначениеАналитики;
						НадоЗаписать = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли РежимЗаписиАналитик = "НеПерезаписывать" Тогда
		Если ИсточникДопАналитик = 0 Тогда
			// 1.1, 3.1: Существующий набор записей не меняется.
			НадоЗаписать = Ложь; // Формальный оператор для понимания происходящего.
		ИначеЕсли ИсточникДопАналитик = 1 ИЛИ ИсточникДопАналитик = 2 Тогда
			НоваяТаблица = ДанныеБазы.Скопировать();
			Для каждого СтрокаТаблицы Из ДополнительныеАналитики Цикл
				РезультатПоиска = НоваяТаблица.Найти(СтрокаТаблицы.Аналитика, "Аналитика");	
				Если РезультатПоиска = Неопределено И ИсточникДопАналитик = 1 Тогда
					// 2.1: Добавить записи, которых не хватет.
					ЗаполнитьЗначенияСвойств(НоваяТаблица.Добавить(), СтрокаТаблицы);
					НадоЗаписать = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	ИначеЕсли РежимЗаписиАналитик = "ПерезаписыватьУстановленные" Тогда
		НоваяТаблица = ДанныеБазы.Скопировать();
		Для каждого СтрокаТаблицы Из ДополнительныеАналитики Цикл
			РезультатПоиска = НоваяТаблица.Найти(СтрокаТаблицы.Аналитика, "Аналитика");	
			Если РезультатПоиска = Неопределено 
			   И (ИсточникДопАналитик = 0 ИЛИ ИсточникДопАналитик = 1) Тогда
				// 1.2, 2.2: Добавить записи, которых не хватет.
				ЗаполнитьЗначенияСвойств(НоваяТаблица.Добавить(), СтрокаТаблицы);
				НадоЗаписать = Истина;
			ИначеЕсли ЗначениеЗаполнено(РезультатПоиска) Тогда
				// 1.2, 2.2 и 3.2: Обновить существующие записи.
				Если РезультатПоиска.ЗначениеАналитики <> СтрокаТаблицы.ЗначениеАналитики Тогда
					РезультатПоиска.ЗначениеАналитики = СтрокаТаблицы.ЗначениеАналитики;
					НадоЗаписать = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НоваяТаблица.ЗаполнитьЗначения(Ссылка, "Объект");
	
	Возврат НоваяТаблица;
	
КонецФункции

#КонецОбласти // ЗаписьИзменений

Функция РезультатКомпоновкиДанныхВыбранныеДокументы(ДанныеФормы, ДанныеОбъекта)
		
	СхемаКомпоновкиДанных = ОбщегоНазначения.ЗначениеИзСтрокиXML(ДанныеФормы.СхемаКомпоновки.Получить());
	Настройки 			  = ОбщегоНазначения.ЗначениеИзСтрокиXML(ДанныеОбъекта.Настройки.Получить());
		
	АдресХранилищаСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	ИсточникНастроек  = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресХранилищаСКД);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	ДатаНачала	  = ДанныеОбъекта.Период.ДатаНачала;
	ДатаОкончания = ДанныеОбъекта.Период.ДатаОкончания;
	
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ДатаНачала", 
		ДатаНачала, ЗначениеЗаполнено(ДатаНачала));
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ДатаОкончания", 
		ДатаОкончания, ЗначениеЗаполнено(ДатаОкончания));
		
	Настройки 		  = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки,,,
							Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , , );
	
	СписокДокументов = Новый ТаблицаЗначений;

	// Вывод таблицы   	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(СписокДокументов); 	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	Возврат СписокДокументов;
	
КонецФункции

Функция РазделительПротоколаТрансляции()

	Разделить = Символы.ПС 
			  + "----------------------------------------------------------------------------------------------------";
	Возврат Разделить;
	
КонецФункции

#КонецОбласти

#КонецЕсли
